{"videos":[{"sortValue":10144,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1393,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10144\/","datePublished":739695600,"title":"What’s new in SwiftUI","summary":"Learn how you can use SwiftUI to build great apps for any Apple platform. Explore a fresh new look and feel for tabs and documents on iPadOS. Improve your window management with new windowing APIs, and gain more control over immersive spaces and volumes in your visionOS apps. We'll also take you through other exciting refinements that help you make expressive charts, customize and layout text, and so much more."},{"sortValue":10211,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1203,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10211\/","datePublished":739782000,"title":"Support real-time ML inference on the CPU","summary":"Discover how you can use BNNSGraph to accelerate the execution of your machine learning model on the CPU. We will show you how to use BNNSGraph to compile and execute a machine learning model on the CPU and share how it provides real-time guarantees such as no runtime memory allocation and single-threaded running for audio or signal processing models."},{"sortValue":2023,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1425,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/2023\/","datePublished":739782000,"title":"Meet FinanceKit","summary":"Learn how FinanceKit lets your financial management apps seamlessly and securely share on-device data from Apple Cash, Apple Card, and more, with user consent and control. Find out how to request one-time and ongoing access to accounts, transactions, and balances — and how to build great experiences for iOS and iPadOS."},{"sortValue":10140,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1249,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10140\/","datePublished":739954800,"title":"Add personality to your app through UX writing","summary":"Every app has a personality that comes across in what you say — and how you say it. Learn how to define your app's voice and modulate your tone for every situation, from celebratory notifications to error messages. We'll help you get specific about your app's purpose and audience and practice writing in different tones."},{"sortValue":10161,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1095,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10161\/","datePublished":739782000,"title":"Deploy machine learning and AI models on-device with Core ML","summary":"Learn new ways to optimize speed and memory performance when you convert and run machine learning and AI models through Core ML. We'll cover new options for model representations, performance insights, execution, and model stitching which can be used together to create compelling and private on-device experiences."},{"sortValue":112,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":3991,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/112\/","datePublished":739695600,"title":"Platforms State of the Union (ASL)","summary":"Discover the newest advancements on Apple platforms."},{"sortValue":10198,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1728,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10198\/","datePublished":739868400,"title":"Run, Break, Inspect: Explore effective debugging in LLDB","summary":"Learn how to use LLDB to explore and debug codebases. We'll show you how to make the most of crashlogs and backtraces, and how to supercharge breakpoints with actions and complex stop conditions. We'll also explore how the “p” command and the latest features in Swift 6 can enhance your debugging experience."},{"sortValue":10181,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":2187,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10181\/","datePublished":739782000,"title":"Xcode essentials","summary":"Edit, debug, commit, repeat. Explore the suite of tools in Xcode that help you iterate quickly when developing apps. Discover tips and tricks to help optimize and boost your development workflow."},{"sortValue":10113,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":520,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10113\/","datePublished":739868400,"title":"Discover media performance metrics in AVFoundation","summary":"Discover how you can monitor, analyze, and improve user experience with the new media performance APIs. Explore how to monitor AVPlayer performance for HLS assets using different AVMetricEvents, and learn how to use these metrics to understand and triage player performance issues."},{"sortValue":10086,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1143,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10086\/","datePublished":739695600,"title":"Design great visionOS apps","summary":"Find out how to create compelling spatial computing apps by embracing immersion, designing for eyes and hands, and taking advantage of depth, scale, and space. We'll share several examples of great visionOS apps and explore how their designers approached creating new experiences for the platform."},{"sortValue":10103,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1891,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10103\/","datePublished":739695600,"title":"Discover RealityKit APIs for iOS, macOS, and visionOS","summary":"Learn how new cross-platform APIs in RealityKit can help you build immersive apps for iOS, macOS, and visionOS. Check out the new hover effects, lights and shadows, and portal crossing features, and view them in action through real examples."},{"sortValue":10146,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1092,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10146\/","datePublished":739868400,"title":"Demystify SwiftUI containers","summary":"Learn about the capabilities of SwiftUI container views and build a mental model for how subviews are managed by their containers. Leverage new APIs to build your own custom containers, create modifiers to customize container content, and give your containers that extra polish that helps your apps stand out.\n"},{"sortValue":10073,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1279,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10073\/","datePublished":739782000,"title":"Catch up on accessibility in SwiftUI","summary":"SwiftUI makes it easy to build amazing experiences that are accessible to everyone. We'll discover how assistive technologies understand and navigate your app through the rich accessibility elements provided by SwiftUI. We'll also discuss how you can further customize these experiences by providing more information about your app's content and interactions by using accessibility modifiers. "},{"sortValue":10150,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1456,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10150\/","datePublished":739695600,"title":"SwiftUI essentials","summary":"Join us on a tour of SwiftUI, Apple's declarative user interface framework. Learn essential concepts for building apps in SwiftUI, like views, state variables, and layout. Discover the breadth of APIs for building fully featured experiences and crafting unique custom components. Whether you're brand new to SwiftUI or an experienced developer, you'll learn how to take advantage of what SwiftUI has to offer when building great apps."},{"sortValue":10197,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1337,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10197\/","datePublished":739782000,"title":"Go small with Embedded Swift","summary":"Embedded Swift brings the safety and expressivity of Swift to constrained environments. Explore how Embedded Swift runs on a variety of microcontrollers through a demonstration using an off-the-shelf Matter device. Learn how the Embedded Swift subset packs the benefits of Swift into a tiny footprint with no runtime, and discover plenty of resources to start your own Embedded Swift adventure."},{"sortValue":10110,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1982,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10110\/","datePublished":739954800,"title":"Implement App Store Offers","summary":"Learn how to engage customers with App Store Offers using App Store Connect, as well as the latest StoreKit features and APIs. Discover how you can set up win-back offers (a new way to re-engage previous subscribers) and generate offer codes for Mac apps. And find out how to test offers in sandbox and Xcode to make sure they work smoothly."},{"sortValue":10124,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1196,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10124\/","datePublished":739695600,"title":"What’s new in AppKit","summary":"Discover the latest advances in Mac app development. Get an overview of the new features in macOS Sequoia, and how to adopt them in your app. Explore new ways to integrate your existing code with SwiftUI. Learn about the improvements made to numerous AppKit controls, like toolbars, menus, text input, and more."},{"sortValue":10200,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1270,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10200\/","datePublished":739954800,"title":"Extend your Xcode Cloud workflows","summary":"Discover how Xcode Cloud can adapt to your development needs. We'll show you how to streamline your workflows, automate testing and distribution with start conditions, custom aliases, custom scripts, webhooks, and the App Store Connect API."},{"sortValue":10157,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1089,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10157\/","datePublished":739782000,"title":"Extend your app’s controls across the system","summary":"Bring your app's controls to Control Center, the Lock Screen, and beyond. Learn how you can use WidgetKit to extend your app's controls to the system experience. We'll cover how you can to build a control, tailor its appearance, and make it configurable."},{"sortValue":10108,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1108,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10108\/","datePublished":739954800,"title":"What’s new in Wallet and Apple Pay","summary":"Take passes and payments to the next level with new enhancements to Wallet and Apple Pay. Make your event tickets shine with rich pass designs in Wallet, and bring great Apple Pay experiences to even more people with third-party browser support. We'll also look at how to disburse funds with Apple Pay on the Web and highlight new API changes that help you integrate Apple Pay into even more purchasing flows."},{"sortValue":10152,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1000,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10152\/","datePublished":739868400,"title":"Create custom hover effects in visionOS","summary":"Learn how to develop custom hover effects that update views when people look at them. Find out how to build an expanding button effect that combines opacity, scale, and clip effects. Discover best practices for creating effects that are comfortable and respect people's accessibility needs."},{"sortValue":10131,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":655,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10131\/","datePublished":739868400,"title":"Support semantic search with Core Spotlight","summary":"Learn how to provide semantic search results in your app using Core Spotlight. Understand how to make your app's content available in the user's private, on-device index so people can search for items using natural language. We'll also share how to optimize your app's performance by scheduling indexing activities.\n\nTo get the most out of this session, we recommend first checking out Core Spotlight documentation on the Apple Developer website."},{"sortValue":10177,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":2069,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10177\/","datePublished":739954800,"title":"Use HDR for dynamic image experiences in your app","summary":"Discover how to read and write HDR images and process HDR content in your app. Explore the new supported HDR image formats and advanced methods for displaying HDR images. Find out how HDR content can coexist with your user interface — and what to watch out for when adding HDR image support to your app."},{"sortValue":10123,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1426,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10123\/","datePublished":739868400,"title":"What’s new in privacy","summary":"At Apple, we believe privacy is a fundamental human right. Learn about new and improved permission flows and other features that manage data in a privacy-preserving way, so that you can focus on creating great app experiences."},{"sortValue":10112,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1165,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10112\/","datePublished":739695600,"title":"Say hello to the next generation of CarPlay design system","summary":"Explore the design system at the heart of the next generation of CarPlay that allows each automaker to express their vehicle's character and brand. Learn how gauges, layouts, dynamic content, and more are deeply customizable and adaptable, allowing you to express your own design philosophy and create an iconic, tailored look. This session is intended for automakers, system developers, and anyone designing a system that supports the next generation of CarPlay."},{"sortValue":111976,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":163,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/111976\/","datePublished":739695600,"title":"18 things from WWDC24","summary":"Here's your guide to the big announcements from this year's Worldwide Developers Conference."},{"sortValue":10148,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":656,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10148\/","datePublished":739868400,"title":"Tailor macOS windows with SwiftUI","summary":"Make your windows feel tailor-made for macOS. Fine-tune your app's windows for focused purposes, ease of use, and to express functionality. Use SwiftUI to style window toolbars and backgrounds. Arrange your windows with precision, and make smart decisions about restoration and minimization."},{"sortValue":10101,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1021,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10101\/","datePublished":739695600,"title":"Explore object tracking for visionOS","summary":"Find out how you can use object tracking to turn real-world objects into virtual anchors in your visionOS app. Learn how you can build spatial experiences with object tracking from start to finish. Find out how to create a reference object using machine learning in Create ML and attach content relative to your target object in Reality Composer Pro, RealityKit or ARKit APIs."},{"sortValue":10074,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":930,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10074\/","datePublished":739954800,"title":"Get started with Dynamic Type","summary":"Dynamic Type lets people choose their preferred text size across the system and all of their apps. To help you get started supporting Dynamic Type, we'll cover the fundamentals: How it works, how to find issues with scaling text in your app, and how to take practical steps using SwiftUI and UIKit to create a great Dynamic Type experience. We'll also show how you can best use the Large Content Viewer to make navigation controls accessible to everyone."},{"sortValue":10084,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":529,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10084\/","datePublished":739782000,"title":"Build custom swimming workouts with WorkoutKit","summary":"Check out the latest in creating, customizing, and scheduling workouts using WorkoutKit. Sprint through the latest in pace and power alerts and expanded support for distance goals. And keep the momentum going with the benefits of custom step names."},{"sortValue":10094,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":982,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10094\/","datePublished":739782000,"title":"Explore game input in visionOS","summary":"Discover how to design and implement great input for your game in visionOS. Learn how system gestures let you provide frictionless ways for players to interact with your games. And explore best practices for supporting custom gestures and game controllers.\n"},{"sortValue":10087,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":567,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10087\/","datePublished":739782000,"title":"Create custom environments for your immersive apps in visionOS","summary":"Discover how to create visually rich and performant customized app environments for Apple Vision Pro. Learn design guidelines, get expert recommendations, and explore techniques you can use in any digital content creation tool to begin building your immersive environment."},{"sortValue":10184,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1656,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10184\/","datePublished":739782000,"title":"A Swift Tour: Explore Swift’s features and design","summary":"Learn the essential features and design philosophy of the Swift programming language. We'll explore how to model data, handle errors, use protocols, write concurrent code, and more while building up a Swift package that has a library, an HTTP server, and a command line client. Whether you're just beginning your Swift journey or have been with us from the start, this talk will help you get the most out of the language."},{"sortValue":10185,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1001,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10185\/","datePublished":739868400,"title":"Build multilingual-ready apps","summary":"Ensure your app works properly and effectively for multilingual users. Learn best practices for text input, display, search, and formatting. Get details on typing in multiple languages without switching between keyboards. And find out how the latest advances in the String Catalog can make localization even easier."},{"sortValue":111977,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":300,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/111977\/","datePublished":739782000,"title":"Platforms State of the Union 5-Minute Recap","summary":"Watch a quick recap of the newest advancements on Apple platforms."},{"sortValue":10155,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":809,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10155\/","datePublished":739695600,"title":"Swift Charts: Vectorized and function plots","summary":"The plot thickens! Learn how to render beautiful charts representing math functions and extensive datasets using function and vectorized plots in your app. Whether you're looking to display functions common in aerodynamics, magnetism, and higher order field theory, or create large interactive heat maps, Swift Charts has you covered."},{"sortValue":10143,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1512,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10143\/","datePublished":739954800,"title":"What’s new in device management","summary":"Learn about the latest management capabilities for iOS, iPadOS, macOS, and visionOS, then discover the latest changes to Apple Business Manager and Apple School Manager. We'll also share updates to Activation Lock, SoftwareUpdate, and Safari management."},{"sortValue":111801,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1400,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/111801\/","datePublished":739695600,"title":"Enhance your spatial computing app with RealityKit audio","summary":"Elevate your spatial computing experience using RealityKit audio. Discover how spatial audio can make your 3D immersive experiences come to life. From ambient audio, reverb, to real-time procedural audio that can add character to your 3D content, learn how RealityKit audio APIs can help make your app more engaging."},{"sortValue":10204,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1369,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10204\/","datePublished":739868400,"title":"Build a great Lock Screen camera capture experience","summary":"Find out how the LockedCameraCapture API can help you bring your capture application's most useful information directly to the Lock Screen. Examine the API's features and functionality, learn how to get started creating a capture extension, and find out how that extension behaves when the device is locked."},{"sortValue":10173,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1983,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10173\/","datePublished":739954800,"title":"Analyze heap memory","summary":"Dive into the basis for your app's dynamic memory: the heap! Explore how to use Instruments and Xcode to measure, analyze, and fix common heap issues. We'll also cover some techniques and best practices for diagnosing transient growth, persistent growth, and leaks in your app."},{"sortValue":10170,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1341,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10170\/","datePublished":739954800,"title":"Consume noncopyable types in Swift","summary":"Get started with noncopyable types in Swift. Discover what copying means in Swift, when you might want to use a noncopyable type, and how value ownership lets you state your intentions clearly."},{"sortValue":10159,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1809,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10159\/","datePublished":739695600,"title":"Bring your machine learning and AI models to Apple silicon","summary":"Learn how to optimize your machine learning and AI models to leverage the power of Apple silicon. Review model conversion workflows to prepare your models for on-device deployment. Understand model compression techniques that are compatible with Apple silicon, and at what stages in your model deployment workflow you can apply them. We'll also explore the tradeoffs between storage size, latency, power usage and accuracy."},{"sortValue":10109,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":860,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10109\/","datePublished":739782000,"title":"Explore wellbeing APIs in HealthKit","summary":"Learn how to incorporate mental health and wellbeing into your app using HealthKit. There are new APIs for State of Mind, as well as for Depression Risk and Anxiety Risk. We'll dive into principles of emotion science to cover how reflecting on feelings can be beneficial, and how State of Mind can be used to represent different types of mood and emotion."},{"sortValue":10100,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":909,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10100\/","datePublished":739695600,"title":"Create enhanced spatial computing experiences with ARKit","summary":"Learn how to create captivating immersive experiences with ARKit's latest features. Explore ways to use room tracking and object tracking to further engage with your surroundings. We'll also share how your app can react to changes in your environment's lighting on this platform. Discover improvements in hand tracking and plane detection which can make your spatial experiences more intuitive."},{"sortValue":10153,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1937,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10153\/","datePublished":739782000,"title":"Dive deep into volumes and immersive spaces","summary":"Discover powerful new ways to customize volumes and immersive spaces in visionOS. Learn to fine-tune how volumes resize and respond to people moving around them. Make volumes and immersive spaces interact through the power of coordinate conversions. Find out how to make your app react when people adjust immersion with the Digital Crown, and use a surrounding effect to dynamically customize the passthrough tint in your immersive space experience."},{"sortValue":10164,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":966,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10164\/","datePublished":739954800,"title":"What’s new in DockKit","summary":"Discover how intelligent tracking in DockKit allows for smoother transitions between subjects. We will cover what intelligent tracking is, how it uses an ML model to select and track subjects, and how you can use it in your app."},{"sortValue":10104,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1945,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10104\/","datePublished":739782000,"title":"Build a spatial drawing app with RealityKit","summary":"Harness the power of RealityKit through the process of building a spatial drawing app. As you create an eye-catching spatial experience that integrates RealityKit with ARKit and SwiftUI, you'll explore how resources work in RealityKit and how to use features like low-level mesh and texture APIs to achieve fast updates of the users' brush strokes."},{"sortValue":10118,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1270,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10118\/","datePublished":739695600,"title":"What’s new in UIKit","summary":"Explore everything new in UIKit, including tab and document launch experiences, transitions, and text and input changes. We'll also discuss better-than-ever interoperability between UIKit and SwiftUI animations and gestures, as well as general improvements throughout UIKit."},{"sortValue":10203,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":924,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10203\/","datePublished":739954800,"title":"Meet AccessorySetupKit","summary":"Elevate your accessory setup experience with AccessorySetupKit. Display a beautiful pairing dialog with an image of your Bluetooth or Wi-Fi accessory — no trip to the Settings app required. Discover how to improve privacy by pairing only your app with an accessory. And learn how you can migrate existing accessories so they can be managed by AccessorySetupKit."},{"sortValue":10066,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1576,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10066\/","datePublished":739868400,"title":"Build immersive web experiences with WebXR","summary":"Discover how WebXR empowers you to add fully immersive experiences to your website in visionOS. Find out how to build WebXR experiences that take full advantage of the input capabilities of visionOS, and learn how you can use Simulator to test WebXR experiences on macOS."},{"sortValue":10102,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":2076,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10102\/","datePublished":739695600,"title":"Compose interactive 3D content in Reality Composer Pro","summary":"Discover how the Timeline view in Reality Composer Pro can bring your 3D content to life. Learn how to create an animated story in which characters and objects interact with each other and the world around them using inverse kinematics, blend shapes, and skeletal poses. We'll also show you how to use built-in and custom actions, sequence your actions, apply triggers, and implement natural movements."},{"sortValue":10125,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":841,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10125\/","datePublished":739782000,"title":"Streamline sign-in with passkey upgrades and credential managers","summary":"Learn how to automatically upgrade existing, password-based accounts to use passkeys. We'll share why and how to improve account security and ease of sign-in, information about new features available for credential manager apps, and how to make your app information shine in the new Passwords app."},{"sortValue":10186,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1333,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10186\/","datePublished":739868400,"title":"Optimize your 3D assets for spatial computing","summary":"Dive into an end-to-end workflow for optimized 3D asset creation. Discover best practices for optimizing meshes, materials, and textures in your digital content creation tool. Learn how to harness shader graph, baking, and material instances to enhance your 3D scene while optimizing performance. Take advantage of native tools to work more effectively with your assets and improve your app's performance."},{"sortValue":10169,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":2508,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10169\/","datePublished":739695600,"title":"Migrate your app to Swift 6","summary":"Experience Swift 6 migration in action as we update an existing sample app. Learn how to migrate incrementally, module by module, and how the compiler helps you identify code that's at risk of data races.  Discover different techniques for ensuring clear isolation boundaries and eliminating concurrent access to shared mutable state."},{"sortValue":10201,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":2186,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10201\/","datePublished":739954800,"title":"Customize spatial Persona templates in SharePlay","summary":"Learn how to use custom spatial Persona templates in your visionOS SharePlay experience to fine-tune the placement of Personas relative to your app. We'll show you how to adopt custom spatial Persona templates in a sample app with SharePlay, move participants between seats, and test your changes in Simulator. We'll also share best practices for designing custom spatial templates that will make your experience shine."},{"sortValue":10068,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":627,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10068\/","datePublished":739695600,"title":"Bring your Live Activity to Apple Watch","summary":"Bring Live Activities into the Smart Stack on Apple Watch with iOS 18 and watchOS 11. We'll cover how Live Activities are presented on Apple Watch, as well as how you can enhance their presentation for the Smart Stack. We'll also explore additional considerations to ensure Live Activities on Apple Watch always present up-to-date information."},{"sortValue":10060,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1421,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10060\/","datePublished":739782000,"title":"Meet AdAttributionKit","summary":"Introducing AdAttributionKit, a new iOS framework for privacy-preserving ad attribution. Learn how AdAttributionKit supports re-engagement, click-through attribution (including support for custom creative), JWS formatted impressions and postbacks, and more. We'll provide insight into testing your AdAttributionKit implementation and deep-dive into code snippets and best practices for adopting AdAttributionKit."},{"sortValue":10147,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":946,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10147\/","datePublished":739695600,"title":"Elevate your tab and sidebar experience in iPadOS","summary":"iPadOS 18 introduces a new navigation system that gives people the flexibility to choose between using a tab bar or sidebar. The newly redesigned tab bar provides more space for content and other functionality. Learn how to use SwiftUI and UIKit to enable customization features – like adding, removing and reordering tabs – to enable a more personal touch in your app."},{"sortValue":10223,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1053,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10223\/","datePublished":739695600,"title":"Explore machine learning on Apple platforms","summary":"Get started with an overview of machine learning frameworks on Apple platforms. Whether you're implementing your first ML model, or an ML expert, we'll offer guidance to help you select the right framework for your app's needs. "},{"sortValue":10139,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1278,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10139\/","datePublished":739695600,"title":"Introducing enterprise APIs for visionOS","summary":"Find out how you can use new enterprise APIs for visionOS to create spatial experiences that enhance employee and customer productivity on Apple Vision Pro."},{"sortValue":10117,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":991,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10117\/","datePublished":739868400,"title":"Meet the Translation API","summary":"Discover how you can translate text across different languages in your app using the new Translation framework.  We'll show you how to quickly display translations in the system UI, and how to translate larger batches of text for your app's UI."},{"sortValue":10107,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":691,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10107\/","datePublished":739868400,"title":"Discover area mode for Object Capture","summary":"Discover how area mode for Object Capture enables new 3D capture possibilities on iOS by extending the functionality of Object Capture to support capture and reconstruction of an area. Learn how to optimize the quality of iOS captures using the new macOS sample app for reconstruction, and find out how to view the final results with Quick Look on Apple Vision Pro, iPhone, iPad or Mac. Learn about improvements to 3D reconstruction, including a new API that allows you to create your own custom image processing pipelines."},{"sortValue":10218,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1506,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10218\/","datePublished":739954800,"title":"Accelerate machine learning with Metal","summary":"Learn how to accelerate your machine learning transformer models with new features in Metal Performance Shaders Graph. We'll also cover how to improve your model's compute bandwidth and quality, and visualize it in the all new MPSGraph viewer."},{"sortValue":10149,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":775,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10149\/","datePublished":739782000,"title":"Work with windows in SwiftUI","summary":"Learn how to create great single and multi-window apps in visionOS, macOS, and iPadOS. Discover tools that let you programmatically open and close windows, adjust position and size, and even replace one window with another. We'll also explore design principles for windows that help people use your app within their workflows."},{"sortValue":10132,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":608,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10132\/","datePublished":739782000,"title":"Evolve your document launch experience","summary":"Make your document-based app stand out, and bring its unique identity into focus with the new document launch experience. Learn how to leverage the new API to customize the first screen people see when they launch your app. Utilize the new system-provided design, and amend it with custom actions, delightful decorative views, and impressive animations."},{"sortValue":10133,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1309,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10133\/","datePublished":739695600,"title":"Bring your app to Siri","summary":"Learn how to use SiriKit and App Intents to expose your app's functionality to Siri and Apple Intelligence. Discover which intents are already available for your use, and how to adopt App Intent domains to integrate actions from your app into the system. Find out what metadata to provide, how to make your entities searchable with Spotlight, how to integrate your app with in-app search, and much more."},{"sortValue":10065,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1209,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10065\/","datePublished":739782000,"title":"Optimize for the spatial web","summary":"Discover how to make the most of visionOS capabilities on the web. Explore recent updates like improvements to selection highlighting, and the ability to present spatial photos and panorama images in fullscreen. Learn to take advantage of existing web standards for dictation and text-to-speech with WebSpeech, spatial soundscapes with WebAudio, and immersive experiences with WebXR."},{"sortValue":10136,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1824,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10136\/","datePublished":739695600,"title":"What’s new in Swift","summary":"Join us for an update on Swift. We'll briefly go through a history of Swift over the past decade, and show you how the community has grown through workgroups, expanded the package ecosystem, and increased platform support. We'll introduce you to a new language mode that achieves data-race safety by default, and a language subset that lets you run Swift on highly constrained systems. We'll also explore some language updates including noncopyable types, typed throws, and improved C++ interoperability."},{"sortValue":10166,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1312,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10166\/","datePublished":739695600,"title":"Build compelling spatial photo and video experiences","summary":"Learn how to adopt spatial photos and videos in your apps. Explore the different types of stereoscopic media and find out how to capture spatial videos in your iOS app on iPhone 15 Pro. Discover the various ways to detect and present spatial media, including the new QuickLook Preview Application API in visionOS. And take a deep dive into the metadata and stereo concepts that make a photo or video spatial."},{"sortValue":10092,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1194,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10092\/","datePublished":739782000,"title":"Render Metal with passthrough in visionOS","summary":"Get ready to extend your Metal experiences for visionOS. Learn best practices for integrating your rendered content with people's physical environments with passthrough. Find out how to position rendered content to match the physical world, reduce latency with trackable anchor prediction, and more."},{"sortValue":10217,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":2076,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10217\/","datePublished":739954800,"title":"Explore Swift performance","summary":"Discover how Swift balances abstraction and performance. Learn what elements of performance to consider and how the Swift optimizer affects them. Explore the different features of Swift and how they're implemented to further understand the tradeoffs available that can impact performance."},{"sortValue":10085,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1434,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10085\/","datePublished":739695600,"title":"Design advanced games for Apple platforms","summary":"Learn how to adapt your high-end game so it feels at home on Mac, iPad, and iPhone. We'll go over how to make your game look stunning on different displays, tailor your input and controls to be intuitive on each device, and take advantage of Apple technologies that deliver great player experiences."},{"sortValue":10145,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":854,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10145\/","datePublished":739782000,"title":"Enhance your UI animations and transitions","summary":"Explore how to adopt the zoom transition in navigation and presentations to increase the sense of continuity in your app, and learn how to animate UIKit views with SwiftUI animations to make it easier to build animations that feel continuous."},{"sortValue":10062,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1929,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10062\/","datePublished":739868400,"title":"Explore App Store server APIs for In-App Purchase","summary":"Learn how to leverage your server to build great In-App Purchase experiences with the latest updates to the App Store Server API, App Store Server Notifications, and the open source App Store Server Library. After a recap of current APIs, we'll introduce updated endpoint functionality, new transaction fields, and a new notification type. We'll also discuss best practices for the purchase lifecycle, delivering content, and targeting offers, so you can become a server power user."},{"sortValue":10106,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":564,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10106\/","datePublished":739954800,"title":"What’s new in USD and MaterialX","summary":"Explore updates to Universal Scene Description and MaterialX support on Apple platforms. Discover how these technologies provide a foundation for 3D content creation and delivery, and learn how they can help streamline your workflows for creating great spatial experiences. Learn about USD and MaterialX support in RealityKit and Storm, advancements in our system-provided tooling, and more."},{"sortValue":10083,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":749,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10083\/","datePublished":739868400,"title":"Get started with HealthKit in visionOS","summary":"Discover how to use HealthKit to create experiences that take full advantage of the spatial canvas. Learn the capabilities of HealthKit on the platform, find out how to bring an existing iPadOS app to visionOS, and explore the special considerations governing HealthKit during a Guest User session. You'll also learn ways to use SwiftUI, Swift Charts, and Swift concurrency to craft innovative experiences with HealthKit."},{"sortValue":10205,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":856,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10205\/","datePublished":739695600,"title":"What’s new in watchOS 11","summary":"Explore new opportunities on Apple Watch, including bringing Double Tap support to your watchOS app, making your Smart Stack widgets even more relevant and interactive, and displaying your iOS Live Activities in the Smart Stack."},{"sortValue":10061,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1380,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10061\/","datePublished":739695600,"title":"What’s new in StoreKit and In-App Purchase","summary":"Learn how to build and deliver even better purchase experiences using the App Store In-App Purchase system. We'll demo new StoreKit views control styles and new APIs to improve your subscription customization, discuss new fields for transaction-level information, and explore new testability in Xcode. We'll also review an important StoreKit deprecation."},{"sortValue":10171,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":928,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10171\/","datePublished":739868400,"title":"Demystify explicitly built modules","summary":"Explore how builds are changing in Xcode 16 with explicitly built modules. Discover how modules are used to build your code, how explicitly built modules improve transparency in compilation tasks, and how you can optimize your build by sharing modules across targets."},{"sortValue":10097,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":999,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10097\/","datePublished":739868400,"title":"Unlock the power of places with MapKit","summary":"Discover powerful new ways to integrate maps into your apps and websites with MapKit and MapKit JS.  Learn how to save and reference unique places using Place ID. Check out improvements to search that make it more efficient to find relevant places.  Get introduced to the new Place Card API that lets you display rich information about places so customers can explore destinations right in your app. And, we'll show you quick ways to embed maps in your website with our simplified token provisioning and Web Embed API."},{"sortValue":10179,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1438,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10179\/","datePublished":739695600,"title":"Meet Swift Testing","summary":"Introducing Swift Testing: a new package for testing your code using Swift. Explore the building blocks of its powerful new API, discover how it can be applied in common testing workflows, and learn how it relates to XCTest and open source Swift."},{"sortValue":10162,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1428,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10162\/","datePublished":739868400,"title":"Keep colors consistent across captures","summary":"Meet the Constant Color API and find out how it can help people use your app to determine precise colors. You'll learn how to adopt the API, explore its scientific and marketing potential, and discover best practices for making the most of the technology."},{"sortValue":101,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":6244,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/101\/","datePublished":739695600,"title":"Keynote","summary":"Don't miss the exciting reveal of the latest Apple software and technologies."},{"sortValue":10134,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1076,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10134\/","datePublished":739782000,"title":"What’s new in App Intents","summary":"Learn about improvements and all-new features with App Intents, and discover how this framework can help you expose your app's functionality to Siri, Spotlight, Shortcuts, and more. We'll show you how to make your entities more meaningful to the platform with the Transferable API, File Representations, new IntentFile APIs, and Spotlight Indexing, opening up powerful functionality in Siri and the Shortcuts app. Empower your intents to take people deep into your app with URL Representable Entities. Explore new techniques to model your entities and intents with new APIs for error handling and union values."},{"sortValue":10067,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":967,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10067\/","datePublished":739695600,"title":"Bring context to today’s weather","summary":"Harness the power of WeatherKit to get detailed weather forecast data such as precipitation amounts by type, cloud cover by altitude, or maximum wind speed. Find out how you can summarize weather by different parts of the day and highlight significant upcoming changes to temperature or precipitation. Understand how you can compare current weather to the past through our Historical Comparisons dataset and dive into historical weather statistics for any location in the world. We'll also explore how you can do all of this faster with our Swift and REST APIs."},{"sortValue":10138,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":832,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10138\/","datePublished":739782000,"title":"Create a custom data store with SwiftData","summary":"Combine the power of SwiftData's expressive, declarative modeling API with your own persistence backend. Learn how to build a custom data store and explore how to progressively add persistence features in your app. To get the most out of this session, watch “Meet SwiftData” and “Model your schema with SwiftData” from WWDC23."},{"sortValue":10088,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":689,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10088\/","datePublished":739954800,"title":"Capture HDR content with ScreenCaptureKit","summary":"Learn how to capture high dynamic colors using ScreenCaptureKit, and explore new features like HDR support, microphone capture, and straight-to-file recording."},{"sortValue":10098,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":518,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10098\/","datePublished":739782000,"title":"Design Live Activities for Apple Watch","summary":"Starting in watchOS 11, Live Activities from your iOS app will automatically appear in the Smart Stack on a connected Apple Watch. Learn how to optimize the layout of your Live Activity for the wrist, and provide the right level of information and interactivity at the right time."},{"sortValue":10114,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":804,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10114\/","datePublished":739695600,"title":"Enhance ad experiences with HLS interstitials","summary":"Explore how HLS Interstitials can help you seamlessly insert advertisements into your HLS content. We'll also show you how to use integrated timeline to tune your UI experience and build SharePlay for interstitials."},{"sortValue":10212,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1096,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10212\/","datePublished":739868400,"title":"What’s new in location authorization","summary":"Location authorization is turning 2.0. Learn about new recommendations and techniques to get the authorization you need, and a new system of diagnostics that can let you know when an authorization goal can't be met."},{"sortValue":10220,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":677,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10220\/","datePublished":739782000,"title":"Bring expression to your app with Genmoji","summary":"Discover how to bring Genmoji to life in your app. We'll go over how to render, store, and communicate text that includes Genmoji. If your app features a custom text engine, we'll also cover techniques for adding support for Genmoji."},{"sortValue":10089,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1772,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10089\/","datePublished":739695600,"title":"Port advanced games to Apple platforms","summary":"Discover how simple it can be to reach players on Apple platforms worldwide. We'll show you how to evaluate your Windows executable on Apple silicon, start your game port with code samples, convert your shader code to Metal, and bring your game to Mac, iPhone, and iPad. Explore enhanced Metal tools that understand HLSL shaders to validate, debug, and profile your ported shaders on Metal."},{"sortValue":10216,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1000,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10216\/","datePublished":739868400,"title":"Explore the Swift on Server ecosystem","summary":"Swift is a great language for writing your server applications, and powers critical services across Apple's cloud products. We'll explore tooling, delve into the Swift server package ecosystem, and demonstrate how to interact with databases and add observability to applications."},{"sortValue":10093,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1122,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10093\/","datePublished":739868400,"title":"Bring your iOS or iPadOS game to visionOS","summary":"Discover how to transform your iOS or iPadOS game into a uniquely visionOS experience. Increase the immersion (and fun factor!) with a 3D frame or an immersive background. And invite players further into your world by adding depth to the window with stereoscopy or head tracking."},{"sortValue":10163,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1009,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10163\/","datePublished":739868400,"title":"Discover Swift enhancements in the Vision framework","summary":"The Vision Framework API has been redesigned to leverage modern Swift features like concurrency, making it easier and faster to integrate a wide array of Vision algorithms into your app. We'll tour the updated API and share sample code, along with best practices, to help you get the benefits of this framework with less coding effort. We'll also demonstrate two new features: image aesthetics and holistic body pose."},{"sortValue":102,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":3991,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/102\/","datePublished":739695600,"title":"Platforms State of the Union","summary":"Discover the newest advancements on Apple platforms."},{"sortValue":10075,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1012,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10075\/","datePublished":739954800,"title":"Track model changes with SwiftData history","summary":"Reveal the history of your model's changes with SwiftData! Use the history API to understand when data store changes occurred, and learn how to use this information to build features like remote server sync and out-of-process change handing in your app. We'll also cover how you can build support for the history API into a custom data store."},{"sortValue":10116,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":842,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10116\/","datePublished":739695600,"title":"Explore multiview video playback in visionOS","summary":"Learn how AVExperienceController can enable playback of multiple videos on Apple Vision Pro. Review best practices for adoption and explore great use cases, like viewing a sports broadcast from different angles or watching multiple games simultaneously. And discover how to design a compelling and intuitive multiview experience in your app."},{"sortValue":10063,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1143,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10063\/","datePublished":739954800,"title":"What’s new in App Store Connect","summary":"Explore new features for discovery, testing, and marketing. Find out how to nominate your apps for featuring on the App Store, share exciting moments (like a version launch) with marketing assets generated for you, deep link to specific content in your app from custom product pages, use the latest enhancements to TestFlight, and more."},{"sortValue":10209,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":955,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10209\/","datePublished":739868400,"title":"Enhanced suggestions for your journaling app","summary":"Find out how your journaling app can display journaling suggestions with richer content from the system. Explore new types of available content like state of mind data, reflection prompts, and support for third-party media content and motion-based activities.\n"},{"sortValue":10210,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1562,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10210\/","datePublished":739695600,"title":"Bring your app’s core features to users with App Intents","summary":"Learn the principles of the App Intents framework, like intents, entities, and queries, and how you can harness them to expose your app's most important functionality right where people need it most. Find out how to build deep integration between your app and the many system features built on top of App Intents, including Siri, controls and widgets, Apple Pencil, Shortcuts, the Action button, and more. Get tips on how to build your App Intents integrations efficiently to create the best experiences in every surface while still sharing code and core functionality."},{"sortValue":10096,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1248,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10096\/","datePublished":739868400,"title":"Design interactive experiences for visionOS","summary":"Learn how you can design a compelling interactive narrative experience for Apple Vision Pro from the designers of Encounter Dinosaurs. Discover how these types of experiences differ from existing apps, media, and games, and explore how to design narratives that bring audiences into new worlds. Find out how you can create stories that adapt to any space and size, provide multiple levels of interaction to make them accessible to all, and use animation, spatial audio, and custom gestures to further immerse people in your experience."},{"sortValue":10122,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":806,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10122\/","datePublished":739954800,"title":"Use CloudKit Console to monitor and optimize database activity","summary":"Discover the new observability features in CloudKit Console. Learn how to use Telemetry and Logging to troubleshoot and optimize your app. Find out how to set up alerts to monitor your application's behavior and notifications to stay on top of the container events that are most important to you.\n\nTo get the most out of this session, we recommend being familiar with CloudKit containers."},{"sortValue":10214,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":898,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10214\/","datePublished":739782000,"title":"Squeeze the most out of Apple Pencil","summary":"New in iOS 18, iPadOS 18, and visionOS 2, the PencilKit tool picker gains the ability to have completely custom tools, with custom attributes. Learn how to express your custom drawing experience in the tool picker using the same great tool picking experience available across the system. Discover how to access the new features of the Apple Pencil Pro, including roll angle, the squeeze gesture, and haptic feedback."},{"sortValue":111,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":6244,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/111\/","datePublished":739695600,"title":"Keynote (ASL)","summary":"Don't miss the exciting reveal of the latest Apple software and technologies."},{"sortValue":10160,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1101,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10160\/","datePublished":739954800,"title":"Train your machine learning and AI models on Apple GPUs","summary":"Learn how to train your models on Apple Silicon with Metal for PyTorch, JAX and TensorFlow. Take advantage of new attention operations and quantization support for improved transformer model performance on your devices."},{"sortValue":10135,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1334,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10135\/","datePublished":739695600,"title":"What’s new in Xcode 16","summary":"Discover the latest productivity and performance improvements in Xcode 16. Learn about enhancements to code completion, diagnostics, and Xcode Previews. Find out more about updates in builds and explore improvements in debugging and Instruments."},{"sortValue":10137,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":841,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10137\/","datePublished":739695600,"title":"What’s new in SwiftData","summary":"SwiftData makes it easy to add persistence to your app with its expressive, declarative API. Learn about refinements to SwiftData, including compound uniqueness constraints, faster queries with #Index, queries in Xcode previews, and rich predicate expressions. Join us to explore how you can use all of these features to express richer models and improve performance in your app.\nTo discover how to build a custom data store or use the history API in SwiftData, watch “Create a custom data store with SwiftData” and “Track model changes with SwiftData history”."},{"sortValue":10195,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1636,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10195\/","datePublished":739782000,"title":"Go further with Swift Testing","summary":"Learn how to write a sweet set of (test) suites using Swift Testing's baked-in features. Discover how to take the building blocks further and use them to help expand tests to cover more scenarios, organize your tests across different suites, and optimize your tests to run in parallel."},{"sortValue":10091,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":999,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10091\/","datePublished":739782000,"title":"Meet TabletopKit for visionOS","summary":"Build a board game for visionOS from scratch using TabletopKit. We'll show you how to set up your game, add powerful rendering using RealityKit, and enable multiplayer using spatial Personas in FaceTime with only a few extra lines of code."},{"sortValue":10183,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":692,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10183\/","datePublished":739782000,"title":"What’s new in Create ML","summary":"Explore updates to Create ML, including interactive data source previews and a new template for building object tracking models for visionOS apps. We'll also cover important framework improvements, including new time-series forecasting and classification APIs."},{"sortValue":10188,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1039,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10188\/","datePublished":739868400,"title":"What’s new in SF Symbols 6","summary":"Explore the latest updates to SF Symbols, Apple's library of iconography designed to integrate seamlessly with San Francisco, the system font for all Apple platforms. Learn how the new Wiggle, Rotate, and Breathe animation presets can bring vitality to your interface. To get the most out of this session, we recommend first watching “What's new in SF Symbols 5” from WWDC23."},{"sortValue":10168,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":744,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10168\/","datePublished":739782000,"title":"Get started with Writing Tools","summary":"Learn how Writing Tools help users proofread, rewrite, and transform text in your app. Get the details on how Writing Tools interact with your app so users can refine what they have written in any text view. Understand how text is retrieved and processed, and how to support Writing Tools in custom text views."},{"sortValue":10207,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1050,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10207\/","datePublished":739782000,"title":"Migrate your TVML app to SwiftUI","summary":"SwiftUI helps you build great apps on all Apple platforms and is the preferred toolkit for bringing your content into the living room with tvOS 18. Learn how to use SwiftUI to create familiar layouts and controls from TVMLKit, and get tips and best practices."},{"sortValue":10176,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":559,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10176\/","datePublished":739868400,"title":"Design App Intents for system experiences","summary":"App Intents power system experiences in controls, Spotlight, Siri, and more. Find out how to identify the functionality that's best for App Intents, and how to use parameters to make these intents flexible. Learn how to use App Intents to allow people to take action outside your app, and see examples of when to navigate into your app to show contextual information."},{"sortValue":10121,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":943,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10121\/","datePublished":739954800,"title":"Meet the Contact Access Button","summary":"Learn about the new Contacts authorization modes and how to improve Contacts access in your app. Discover how to integrate the Contact Access Button into your app to share additional contacts on demand and provide an easier path to Contacts authorization. We'll also cover Contacts security features and an alternative API to be used if the button isn't appropriate for your app."},{"sortValue":10111,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1660,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10111\/","datePublished":739695600,"title":"Meet the next generation of CarPlay architecture","summary":"Dive into the architecture for the next generation of CarPlay. Learn how your vehicle system works with iPhone to create a single cohesive experience that showcases the best of your car and iPhone. Learn how UI is rendered and composited, and explore ways to configure and customize a special experience for each vehicle model. This session is intended for automakers and system developers interested in the next generation of CarPlay."},{"sortValue":10069,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":768,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10069\/","datePublished":739868400,"title":"Broadcast updates to your Live Activities","summary":"With broadcast push notifications, your app can send updates to thousands of Live Activities with a single request. We'll discover how broadcast push notifications work between an app, a server, and the Apple Push Notification service, then we'll walk through best practices for this capability and how to implement it."},{"sortValue":10151,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1566,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10151\/","datePublished":739954800,"title":"Create custom visual effects with SwiftUI","summary":"Discover how to create stunning visual effects in SwiftUI. Learn to build unique scroll effects, rich color treatments, and custom transitions. We'll also explore advanced graphic effects using Metal shaders and custom text rendering."},{"sortValue":10115,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1046,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10115\/","datePublished":739782000,"title":"Enhance the immersion of media viewing in custom environments","summary":"Extend your media viewing experience using Reality Composer Pro components like Docking Region, Reverb, and Virtual Environment Probe. Find out how to further enhance immersion using Reflections, Tint Surroundings Effect, SharePlay, and the Immersive Environment Picker."},{"sortValue":10105,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":864,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10105\/","datePublished":739954800,"title":"What’s new in Quick Look for visionOS","summary":"Explore how Quick Look in visionOS can elevate file preview and editing experiences in your app. We'll cover the integration of in-app and windowed Quick Look, as well as a brand-new API that customizes the windowed Quick Look experience in your app. We'll also share the latest enhancements to viewing 3D models within Quick Look."},{"sortValue":10172,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":1450,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10172\/","datePublished":739868400,"title":"Break into the RealityKit debugger","summary":"Meet the RealityKit debugger and discover how this new tool lets you inspect the entity hierarchy of spatial apps, debug rogue transformations, find missing entities, and detect which parts of your code are causing problems for your systems."},{"sortValue":10070,"eventUrl":"https:\/\/developer.apple.com\/videos\/wwdc2024","duration":885,"url":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10070\/","datePublished":739868400,"title":"Customize feature discovery with TipKit","summary":"Focused on feature discovery, the TipKit framework makes it easy to display tips in your app. Now you can group tips so features are discovered in the ideal order, make tips reusable with custom tip identifiers, match the look and feel to your app, and sync tips using CloudKit. Learn how you can use the latest advances in TipKit to help people discover everything your app has to offer."}],"videoTopics":[{"topicUrl":"https:\/\/developer.apple.com\/videos\/essentials\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10144\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/spatial-computing\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10144\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/swiftui-ui-frameworks\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10144\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/machine-learning-ai\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10211\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/app-services\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/2023\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/design\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10140\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/machine-learning-ai\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10161\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/essentials\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/112\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/developer-tools\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10198\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/swift\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10198\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/developer-tools\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10181\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/essentials\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10181\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/audio-video\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10113\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/design\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10086\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/graphics-games\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10086\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/spatial-computing\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10086\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/developer-tools\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10103\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/graphics-games\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10103\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/spatial-computing\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10103\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/swiftui-ui-frameworks\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10146\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/accessibility-inclusion\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10073\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/swiftui-ui-frameworks\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10073\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/essentials\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10150\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/swiftui-ui-frameworks\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10150\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/swift\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10197\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/app-services\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10110\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/app-store-distribution-marketing\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10110\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/app-services\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10124\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/swiftui-ui-frameworks\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10124\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/developer-tools\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10200\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/essentials\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10200\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/app-services\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10157\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/swiftui-ui-frameworks\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10157\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/app-services\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10108\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/design\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10152\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/spatial-computing\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10152\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/swiftui-ui-frameworks\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10152\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/app-services\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10131\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/machine-learning-ai\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10131\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/swiftui-ui-frameworks\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10131\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/audio-video\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10177\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/machine-learning-ai\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10177\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/photos-camera\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10177\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/privacy-security\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10123\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/design\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10112\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/system-services\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10112\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/essentials\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/111976\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/swiftui-ui-frameworks\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10148\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/machine-learning-ai\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10101\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/spatial-computing\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10101\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/accessibility-inclusion\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10074\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/swiftui-ui-frameworks\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10074\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/app-services\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10084\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/health-fitness\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10084\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/design\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10094\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/graphics-games\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10094\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/spatial-computing\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10094\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/design\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10087\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/spatial-computing\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10087\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/developer-tools\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10184\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/essentials\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10184\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/swift\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10184\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/app-services\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10185\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/swiftui-ui-frameworks\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10185\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/essentials\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/111977\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/app-services\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10155\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/swiftui-ui-frameworks\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10155\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/business-education\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10143\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/developer-tools\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/111801\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/graphics-games\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/111801\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/spatial-computing\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/111801\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/machine-learning-ai\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10204\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/photos-camera\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10204\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/developer-tools\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10173\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/swift\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10173\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/swift\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10170\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/machine-learning-ai\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10159\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/app-services\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10109\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/health-fitness\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10109\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/spatial-computing\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10100\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/spatial-computing\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10153\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/swiftui-ui-frameworks\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10153\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/machine-learning-ai\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10164\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/photos-camera\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10164\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/developer-tools\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10104\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/graphics-games\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10104\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/spatial-computing\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10104\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/app-services\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10118\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/swiftui-ui-frameworks\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10118\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/privacy-security\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10203\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/system-services\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10203\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/app-services\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10066\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/safari-web\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10066\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/spatial-computing\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10066\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/developer-tools\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10102\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/spatial-computing\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10102\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/app-services\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10125\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/privacy-security\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10125\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/system-services\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10125\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/graphics-games\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10186\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/spatial-computing\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10186\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/developer-tools\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10169\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/swift\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10169\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/app-services\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10201\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/audio-video\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10201\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/spatial-computing\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10201\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/app-services\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10068\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/app-services\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10060\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/app-store-distribution-marketing\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10060\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/design\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10147\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/swiftui-ui-frameworks\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10147\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/machine-learning-ai\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10223\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/app-services\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10139\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/audio-video\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10139\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/business-education\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10139\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/machine-learning-ai\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10139\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/photos-camera\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10139\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/spatial-computing\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10139\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/app-services\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10117\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/machine-learning-ai\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10117\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/developer-tools\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10107\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/graphics-games\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10107\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/spatial-computing\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10107\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/graphics-games\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10218\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/machine-learning-ai\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10218\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/spatial-computing\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10149\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/swiftui-ui-frameworks\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10149\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/swiftui-ui-frameworks\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10132\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/app-services\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10133\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/machine-learning-ai\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10133\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/safari-web\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10065\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/spatial-computing\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10065\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/developer-tools\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10136\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/swift\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10136\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/photos-camera\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10166\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/spatial-computing\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10166\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/graphics-games\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10092\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/spatial-computing\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10092\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/swift\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10217\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/design\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10085\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/graphics-games\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10085\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/design\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10145\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/swiftui-ui-frameworks\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10145\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/app-store-distribution-marketing\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10062\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/developer-tools\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10106\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/graphics-games\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10106\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/spatial-computing\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10106\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/health-fitness\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10083\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/spatial-computing\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10083\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/app-services\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10205\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/health-fitness\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10205\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/swiftui-ui-frameworks\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10205\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/app-services\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10061\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/app-store-distribution-marketing\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10061\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/swiftui-ui-frameworks\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10061\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/developer-tools\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10171\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/app-services\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10097\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/maps-location\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10097\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/safari-web\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10097\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/developer-tools\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10179\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/essentials\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10179\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/swift\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10179\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/machine-learning-ai\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10162\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/photos-camera\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10162\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/essentials\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/101\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/app-services\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10134\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/machine-learning-ai\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10134\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/maps-location\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10067\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/app-services\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10138\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/swift\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10138\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/audio-video\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10088\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/graphics-games\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10088\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/app-services\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10098\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/design\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10098\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/audio-video\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10114\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/maps-location\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10212\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/privacy-security\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10212\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/swiftui-ui-frameworks\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10220\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/developer-tools\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10089\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/graphics-games\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10089\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/swift\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10216\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/graphics-games\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10093\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/spatial-computing\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10093\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/machine-learning-ai\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10163\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/essentials\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/102\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/app-services\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10075\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/swift\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10075\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/audio-video\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10116\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/design\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10116\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/spatial-computing\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10116\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/app-store-distribution-marketing\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10063\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/app-services\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10209\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/health-fitness\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10209\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/app-services\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10210\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/machine-learning-ai\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10210\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/design\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10096\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/spatial-computing\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10096\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/system-services\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10122\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/app-services\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10214\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/swiftui-ui-frameworks\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10214\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/essentials\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/111\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/app-services\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10160\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/machine-learning-ai\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10160\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/developer-tools\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10135\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/essentials\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10135\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/swift\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10135\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/swiftui-ui-frameworks\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10135\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/app-services\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10137\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/swift\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10137\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/developer-tools\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10195\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/swift\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10195\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/graphics-games\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10091\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/spatial-computing\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10091\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/machine-learning-ai\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10183\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/design\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10188\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/swiftui-ui-frameworks\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10188\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/machine-learning-ai\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10168\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/swiftui-ui-frameworks\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10168\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/audio-video\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10207\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/swiftui-ui-frameworks\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10207\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/design\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10176\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/machine-learning-ai\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10176\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/app-services\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10121\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/swiftui-ui-frameworks\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10121\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/system-services\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10111\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/app-services\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10069\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/design\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10151\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/graphics-games\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10151\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/swiftui-ui-frameworks\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10151\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/audio-video\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10115\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/spatial-computing\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10115\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/graphics-games\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10105\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/safari-web\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10105\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/spatial-computing\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10105\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/developer-tools\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10172\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/graphics-games\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10172\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/spatial-computing\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10172\/"},{"topicUrl":"https:\/\/developer.apple.com\/videos\/app-services\/","videoUrl":"https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10070\/"}],"topics":[{"name":"Accessibility & Inclusion","url":"https:\/\/developer.apple.com\/videos\/accessibility-inclusion\/","icon":"person.2.outline"},{"name":"App Services","icon":"gearshape.outline","url":"https:\/\/developer.apple.com\/videos\/app-services\/"},{"name":"App Store, Distribution & Marketing","icon":"chart.bar.xaxis","url":"https:\/\/developer.apple.com\/videos\/app-store-distribution-marketing\/"},{"name":"Audio & Video","icon":"tv.and.hifispeaker.outline","url":"https:\/\/developer.apple.com\/videos\/audio-video\/"},{"name":"Business & Education","icon":"briefcase.outline","url":"https:\/\/developer.apple.com\/videos\/business-education\/"},{"name":"Design","icon":"paintbrush.outline","url":"https:\/\/developer.apple.com\/videos\/design\/"},{"name":"Developer Tools","icon":"hammer.outline","url":"https:\/\/developer.apple.com\/videos\/developer-tools\/"},{"name":"Essentials","icon":"cube.outline","url":"https:\/\/developer.apple.com\/videos\/essentials\/"},{"name":"Graphics & Games","icon":"gamecontroller.outline","url":"https:\/\/developer.apple.com\/videos\/graphics-games\/"},{"name":"Health & Fitness","icon":"heart.outline","url":"https:\/\/developer.apple.com\/videos\/health-fitness\/"},{"name":"Machine Learning & AI","icon":"eye.outline","url":"https:\/\/developer.apple.com\/videos\/machine-learning-ai\/"},{"name":"Maps & Location","url":"https:\/\/developer.apple.com\/videos\/maps-location\/","icon":"map.outline"},{"name":"Photos & Camera","url":"https:\/\/developer.apple.com\/videos\/photos-camera\/","icon":"camera.outline"},{"name":"Privacy & Security","url":"https:\/\/developer.apple.com\/videos\/privacy-security\/","icon":"hand.raised.outline"},{"name":"Safari & Web","url":"https:\/\/developer.apple.com\/videos\/safari-web\/","icon":"safari.outline"},{"name":"Spatial Computing","url":"https:\/\/developer.apple.com\/videos\/spatial-computing\/","icon":"visionpro.outline"},{"name":"Swift","url":"https:\/\/developer.apple.com\/videos\/swift\/","icon":"swift"},{"name":"SwiftUI & UI Frameworks","url":"https:\/\/developer.apple.com\/videos\/swiftui-ui-frameworks\/","icon":"switch.2"},{"name":"System Services","url":"https:\/\/developer.apple.com\/videos\/system-services\/","icon":"network"}],"event":{"name":"WWDC24","url":"https:\/\/developer.apple.com\/videos\/wwdc2024"}}